# Создаем переменную name и присваиваем ей ваше имя
name = "Yuriy"
# Выводим значение переменной name на экран
print(name)
# Создаем переменную age и присваиваем ей ваш возраст
age = 50
# Выводим значение переменной age на экран
print(age)
# Перезаписываем значение переменной age, добавляя к текущему значению новое
age = age+2
# Выводим измененное значение переменной age на экран
print(age)
# Создаем переменную is_student и присваиваем ей логическое значение True
is_student = True
# Выводим значение переменной is_student на экран
print(is_student)